Revit 2024 API
WorksetConfiguration Members
The WorksetConfiguration type exposes the following members.
Constructors
Name | Description
WorksetConfiguration()
 Constructs a new workset configuration with an initial setting to open all user-created worksets.
WorksetConfiguration(WorksetConfiguration)
 Constructs a new copy of the input WorksetConfiguration object.
WorksetConfiguration(WorksetConfigurationOption)
 Constructs a new workset configuration with an initial setting to open or close all user-created worksets, or to open last viewed worksets.
Methods
Name | Description
Close
 Sets a group of user-created worksets to close.
Dispose
Releases all resources used by the WorksetConfiguration
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Open
 Sets a group of user-created worksets to open.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
WorksetConfiguration Class
Autodesk.Revit.DB Namespace